app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "aaaaa"], ["updated_at", "2016-08-30 02:00:59.559260"], ["id", 4]]
---
  def update
    @artist = Artist.find(params[:id])

    @artist.update(artist_params)